Revit 2026 API

# ExternalResourceMatchOptions Constructor

---

Constructs new instance with specified resource type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExternalResourceMatchOptions(
	ExternalResourceType resourceType
)
```
```vb
Public Sub New (
	resourceType As ExternalResourceType
)
```
```cpp
public:
ExternalResourceMatchOptions(
	ExternalResourceType^ resourceType
)
```
```fsharp
new :
        resourceType : ExternalResourceType -> ExternalResourceMatchOptions
```

#### Parameters

resourceType ExternalResourceType
     The desired resource type.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExternalResourceMatchOptions Class

Autodesk.Revit.DB Namespace